<!-- terraform cdk action for options with hash d1c5aaf7515e319320b2c73ea21429a7 -->
### ✅ Successfully planned Terraform CDK Stack 'graasp-dev'



<details><summary>Show Plan</summary>

```shell
npm warn deprecated inflight@1.0.6: This module is not supported, and leaks memory. Do not use it. Check out lru-cache if you want a good and tested way to coalesce async requests by a key value, which is much more comprehensive and powerful.
npm warn deprecated glob@7.2.3: Glob versions prior to v9 are no longer supported
npm warn deprecated glob@7.2.3: Glob versions prior to v9 are no longer supported
npm warn deprecated glob@7.2.3: Glob versions prior to v9 are no longer supported
graasp-dev  Initializing the backend...
graasp-dev  Successfully configured the backend "s3"! Terraform will automatically
            use this backend unless the backend configuration changes.
graasp-dev  Initializing modules...
graasp-dev  Downloading registry.terraform.io/terraform-aws-modules/rds/aws 6.10.0 for graasp-dev-etherpad-postgres_db_17D31B7A...
graasp-dev  - graasp-dev-etherpad-postgres_db_17D31B7A in .terraform/modules/graasp-dev-etherpad-postgres_db_17D31B7A
graasp-dev  - graasp-dev-etherpad-postgres_db_17D31B7A.db_instance in .terraform/modules/graasp-dev-etherpad-postgres_db_17D31B7A/modules/db_instance
graasp-dev  - graasp-dev-etherpad-postgres_db_17D31B7A.db_instance_role_association in .terraform/modules/graasp-dev-etherpad-postgres_db_17D31B7A/modules/db_instance_role_association
            - graasp-dev-etherpad-postgres_db_17D31B7A.db_option_group in .terraform/modules/graasp-dev-etherpad-postgres_db_17D31B7A/modules/db_option_group
            - graasp-dev-etherpad-postgres_db_17D31B7A.db_parameter_group in .terraform/modules/graasp-dev-etherpad-postgres_db_17D31B7A/modules/db_parameter_group
            - graasp-dev-etherpad-postgres_db_17D31B7A.db_subnet_group in .terraform/modules/graasp-dev-etherpad-postgres_db_17D31B7A/modules/db_subnet_group
graasp-dev  Downloading registry.terraform.io/terraform-aws-modules/rds/aws 6.10.0 for graasp-dev-postgres_db_F1D5DB7A...
graasp-dev  - graasp-dev-postgres_db_F1D5DB7A in .terraform/modules/graasp-dev-postgres_db_F1D5DB7A
graasp-dev  - graasp-dev-postgres_db_F1D5DB7A.db_instance in .terraform/modules/graasp-dev-postgres_db_F1D5DB7A/modules/db_instance
            - graasp-dev-postgres_db_F1D5DB7A.db_instance_role_association in .terraform/modules/graasp-dev-postgres_db_F1D5DB7A/modules/db_instance_role_association
            - graasp-dev-postgres_db_F1D5DB7A.db_option_group in .terraform/modules/graasp-dev-postgres_db_F1D5DB7A/modules/db_option_group
            - graasp-dev-postgres_db_F1D5DB7A.db_parameter_group in .terraform/modules/graasp-dev-postgres_db_F1D5DB7A/modules/db_parameter_group
            - graasp-dev-postgres_db_F1D5DB7A.db_subnet_group in .terraform/modules/graasp-dev-postgres_db_F1D5DB7A/modules/db_subnet_group
graasp-dev  Downloading registry.terraform.io/terraform-aws-modules/vpc/aws 5.14.0 for vpc...
graasp-dev
graasp-dev  - vpc in .terraform/modules/vpc
graasp-dev  Initializing provider plugins...
graasp-dev  - Finding hashicorp/aws versions matching ">= 5.46.0, >= 5.59.0, >= 5.62.0, 5.70.0"...
graasp-dev  - Finding hashicorp/random versions matching ">= 3.1.0"...
graasp-dev  - Installing hashicorp/aws v5.70.0...
graasp-dev  - Installed hashicorp/aws v5.70.0 (signed by HashiCorp)
graasp-dev  - Installing hashicorp/random v3.6.3...
graasp-dev  - Installed hashicorp/random v3.6.3 (signed by HashiCorp)

            Terraform has created a lock file .terraform.lock.hcl to record the provider
            selections it made above. Include this file in your version control repository
            so that Terraform can guarantee to make the same selections by default when
            you run "terraform init" in the future.
graasp-dev  Terraform has been successfully initialized!

            You may now begin working with Terraform. Try running "terraform plan" to see
            any changes that are required for your infrastructure. All Terraform commands
            should now work.

            If you ever set or change modules or backend configuration for Terraform,
            rerun this command to reinitialize your working directory. If you forget, other
            commands will detect it and remind you to do so if necessary.
graasp-dev  - Fetching hashicorp/aws 5.70.0 for linux_amd64...
graasp-dev  - Retrieved hashicorp/aws 5.70.0 for linux_amd64 (signed by HashiCorp)
graasp-dev  - Fetching hashicorp/random 3.6.3 for linux_amd64...
graasp-dev  - Retrieved hashicorp/random 3.6.3 for linux_amd64 (signed by HashiCorp)
            - Obtained hashicorp/aws checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
            - Obtained hashicorp/random checksums for linux_amd64; All checksums for this platform were already tracked in the lock file
graasp-dev  Success! Terraform has validated the lock file and found no need for changes.
graasp-dev  module.graasp-dev-etherpad-postgres_db_17D31B7A.module.db_instance.random_id.snapshot_identifier[0]: Refreshing state... [id=FdxyXQ]
            module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.random_id.snapshot_identifier[0]: Refreshing state... [id=SHBibw]
graasp-dev  data.aws_acm_certificate.graasp-dev-acm-cert (graasp-dev-acm-cert): Reading...
graasp-dev  data.aws_acm_certificate.graasp-dev-acm-cert (graasp-dev-acm-cert): Read complete after 1s [id=arn:aws:acm:us-east-1:299720865162:certificate/46cb9d1f-aea8-42de-8232-a5b83f1cc7e2]
graasp-dev  data.aws_ecr_repository.graasp-dev-ecr (graasp-dev-ecr): Reading...
graasp-dev  aws_elasticache_subnet_group.graasp-dev-redis_graasp-dev-redis-subnet-group_E192F4DD: Refreshing state... [id=graasp-dev]
            aws_vpc_security_group_ingress_rule.graasp-dev-redis_graasp-dev-redis-allow-graasp-backend_780780FB: Refreshing state... [id=sgr-04815752da7a5a0ca]
            aws_s3_bucket.graasp-dev-auth_bucket_09E0996B (graasp-dev-auth/bucket): Refreshing state... [id=graasp-dev-auth]
            module.graasp-dev-postgres_db_F1D5DB7A.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=graasp-postgres15-20231009123434812500000001]
            aws_elasticache_cluster.graasp-dev-redis_C864F0E3: Refreshing state... [id=graasp-dev-redis]
            aws_security_group.graasp-dev-redis_graasp-dev-redis-security-group_726BAF0A: Refreshing state... [id=sg-028d965f91f27e896]
            aws_s3_bucket.graasp-dev-map_bucket_39F233B6 (graasp-dev-map/bucket): Refreshing state... [id=graasp-dev-map]
            aws_service_discovery_http_namespace.graasp-dev_namespace_B6F7BA2C (graasp-dev/namespace): Refreshing state... [id=ns-us3rov3ukfoth5ox]
            aws_vpc_security_group_egress_rule.graasp-dev-redis_graasp-dev-redis-allow-all_ED3B9B56: Refreshing state... [id=sgr-0c1da168f3e9c7c2a]
graasp-dev  aws_s3_bucket.graasp-dev-landing_bucket_31DB2945 (graasp-dev-landing/bucket): Refreshing state... [id=graasp-dev-landing]
graasp-dev  module.graasp-dev-etherpad-postgres_db_17D31B7A.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=graasp-postgres15-20231009123434818400000002]
graasp-dev  aws_cloudwatch_log_group.graasp-dev_graasp-library-loggroup_FD22B99E (graasp-dev/graasp-library-loggroup): Refreshing state... [id=/ecs/graasp-library]
graasp-dev  aws_s3_bucket.graasp-dev-h5p_bucket_B545A43B (graasp-dev-h5p/bucket): Refreshing state... [id=graasp-dev-h5p]
graasp-dev  aws_s3_bucket.graasp-dev-admin_bucket_CD8D86EC (graasp-dev-admin/bucket): Refreshing state... [id=graasp-dev-admin]
graasp-dev  aws_s3_bucket.graasp-dev-file-items_bucket_12606B30 (graasp-dev-file-items/bucket): Refreshing state... [id=graasp-dev-file-items]
graasp-dev  aws_iam_role.graasp-dev_ecs-execution-role_A4D135E8 (graasp-dev/ecs-execution-role): Refreshing state... [id=graasp-dev-ecs-execution-role]
graasp-dev  data.aws_ecr_repository.graasp-dev-ecr (graasp-dev-ecr): Read complete after 1s [id=graasp]
graasp-dev  module.graasp-dev-etherpad-postgres_db_17D31B7A.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
graasp-dev  module.graasp-dev-etherpad-postgres_db_17D31B7A.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
            data.aws_ecr_repository.graasp-dev-explore-ecr (graasp-dev-explore-ecr): Reading...
graasp-dev  module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0b312f17d2e08cb6e]
graasp-dev  aws_s3_bucket.graasp-dev-maintenance_bucket_46B8FAD7 (graasp-dev-maintenance/bucket): Refreshing state... [id=graasp-dev-maintenance]
graasp-dev  aws_cloudwatch_log_group.graasp-dev_meilisearch-loggroup_F1AD2775 (graasp-dev/meilisearch-loggroup): Refreshing state... [id=/ecs/meilisearch]
graasp-dev  data.aws_ecr_repository.graasp-dev-explore-ecr (graasp-dev-explore-ecr): Read complete after 1s [id=graasp/explore]
graasp-dev  aws_cloudwatch_log_group.graasp-dev_graasp-loggroup_44ECC8C2 (graasp-dev/graasp-loggroup): Refreshing state... [id=/ecs/graasp]
graasp-dev  data.aws_acm_certificate.graasp-dev-acm-cert (graasp-dev-acm-cert)-lb: Reading...
graasp-dev  module.graasp-dev-etherpad-postgres_db_17D31B7A.module.db_instance.data.aws_partition.current: Reading...
graasp-dev  module.graasp-dev-etherpad-postgres_db_17D31B7A.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
            module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.data.aws_partition.current: Reading...
            module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
            aws_cloudwatch_log_group.graasp-dev_etherpad-loggroup_200385B4 (graasp-dev/etherpad-loggroup): Refreshing state... [id=/ecs/etherpad]
graasp-dev  aws_cloudwatch_log_group.graasp-dev_iframely-loggroup_105420D9 (graasp-dev/iframely-loggroup): Refreshing state... [id=/ecs/iframely]
graasp-dev  aws_s3_bucket.graasp-dev-analytics_bucket_E7907EE2 (graasp-dev-analytics/bucket): Refreshing state... [id=graasp-dev-analytics]
graasp-dev  aws_s3_bucket.graasp-dev-player_bucket_F2A2D347 (graasp-dev-player/bucket): Refreshing state... [id=graasp-dev-player]
graasp-dev  aws_s3_bucket.graasp-dev-assets_bucket_8930785E (graasp-dev-assets/bucket): Refreshing state... [id=graasp-dev-assets]
graasp-dev  data.aws_ecr_repository.graasp-dev-etherpad-ecr (graasp-dev-etherpad-ecr): Reading...
graasp-dev  aws_s3_bucket.graasp-dev-account_bucket_17879B4C (graasp-dev-account/bucket): Refreshing state... [id=graasp-dev-account]
graasp-dev  aws_s3_bucket.graasp-dev-apps_bucket_F4170225 (graasp-dev-apps/bucket): Refreshing state... [id=graasp-dev-apps]
graasp-dev  aws_s3_bucket.graasp-dev-builder_bucket_E21AE40A (graasp-dev-builder/bucket): Refreshing state... [id=graasp-dev-builder]
            data.aws_ecr_repository.graasp-dev-etherpad-ecr (graasp-dev-etherpad-ecr): Read complete after 1s [id=graasp/etherpad]
            aws_ecs_cluster.cluster (cluster): Refreshing state... [id=arn:aws:ecs:eu-central-1:299720865162:cluster/graasp-dev]
graasp-dev  module.graasp-dev-etherpad-postgres_db_17D31B7A.module.db_instance.aws_iam_role.enhanced_monitoring[0]: Refreshing state... [id=graasp-dev-etherpad-rds-monitoring-role]
graasp-dev  data.aws_acm_certificate.graasp-dev-acm-cert (graasp-dev-acm-cert)-lb: Read complete after 1s [id=arn:aws:acm:eu-central-1:299720865162:certificate/af9d071d-3aa1-4583-905d-ec1efd5515d3]
graasp-dev  aws_iam_role_policy.graasp-dev_graasp-dev-ecs-execution-role-policies_D65DB830 (graasp-dev/graasp-dev-ecs-execution-role-policies): Refreshing state... [id=graasp-dev-ecs-execution-role:allow-ecr-pull]
graasp-dev  aws_ecs_task_definition.graasp-dev_graasp_54E40EB5 (graasp-dev/graasp): Refreshing state... [id=graasp]
graasp-dev  aws_ecs_task_definition.graasp-dev_meilisearch_38A3D0B6 (graasp-dev/meilisearch): Refreshing state... [id=meilisearch]
graasp-dev  aws_ecs_task_definition.graasp-dev_iframely_4C5E8E3D (graasp-dev/iframely): Refreshing state... [id=iframely]
graasp-dev  aws_ecs_task_definition.graasp-dev_graasp-library_B38B90C0 (graasp-dev/graasp-library): Refreshing state... [id=graasp-library]
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.aws_iam_role.enhanced_monitoring[0]: Refreshing state... [id=graasp-dev-rds-monitoring-role]
graasp-dev  aws_s3_bucket_public_access_block.graasp-dev-map_s3-block-public-access_8EB89E00 (graasp-dev-map/s3-block-public-access): Refreshing state... [id=graasp-dev-map]
graasp-dev  data.aws_iam_policy_document.graasp-dev-map_allow_public_access_7B3C8D01 (graasp-dev-map/allow_public_access): Reading...
graasp-dev  data.aws_iam_policy_document.graasp-dev-map_allow_public_access_7B3C8D01 (graasp-dev-map/allow_public_access): Read complete after 0s [id=3315807021]
            aws_s3_bucket_ownership_controls.graasp-dev-map_s3-bucket-ownership_AF396C08 (graasp-dev-map/s3-bucket-ownership): Refreshing state... [id=graasp-dev-map]
graasp-dev  aws_s3_bucket_website_configuration.graasp-dev-map_s3-website-configuration_B0E1C26E (graasp-dev-map/s3-website-configuration): Refreshing state... [id=graasp-dev-map]
graasp-dev  aws_s3_bucket_ownership_controls.graasp-dev-auth_s3-bucket-ownership_5182BB9F (graasp-dev-auth/s3-bucket-ownership): Refreshing state... [id=graasp-dev-auth]
graasp-dev  data.aws_iam_policy_document.graasp-dev-auth_allow_public_access_0D0CE7D9 (graasp-dev-auth/allow_public_access): Reading...
graasp-dev  data.aws_iam_policy_document.graasp-dev-auth_allow_public_access_0D0CE7D9 (graasp-dev-auth/allow_public_access): Read complete after 0s [id=138587570]
            aws_s3_bucket_public_access_block.graasp-dev-auth_s3-block-public-access_61A2029D (graasp-dev-auth/s3-block-public-access): Refreshing state... [id=graasp-dev-auth]
graasp-dev  aws_s3_bucket_website_configuration.graasp-dev-auth_s3-website-configuration_47B58E1B (graasp-dev-auth/s3-website-configuration): Refreshing state... [id=graasp-dev-auth]
graasp-dev  module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0de0872c207e953b3]
graasp-dev  module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0fd249cba5ab4c742]
graasp-dev  module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-06ce6a79ac9494ac3]
graasp-dev  aws_s3_bucket_website_configuration.graasp-dev-h5p_s3-website-configuration_5FB93898 (graasp-dev-h5p/s3-website-configuration): Refreshing state... [id=graasp-dev-h5p]
graasp-dev  data.aws_iam_policy_document.graasp-dev-h5p_allow_public_access_04C01E9A (graasp-dev-h5p/allow_public_access): Reading...
graasp-dev  data.aws_iam_policy_document.graasp-dev-h5p_allow_public_access_04C01E9A (graasp-dev-h5p/allow_public_access): Read complete after 0s [id=1897348743]
            aws_s3_bucket_public_access_block.graasp-dev-h5p_s3-block-public-access_2D472005 (graasp-dev-h5p/s3-block-public-access): Refreshing state... [id=graasp-dev-h5p]
graasp-dev  aws_s3_bucket_cors_configuration.graasp-dev-h5p_s3-cors-config_EC778FA8 (graasp-dev-h5p/s3-cors-config): Refreshing state... [id=graasp-dev-h5p]
graasp-dev  aws_s3_bucket_ownership_controls.graasp-dev-h5p_s3-bucket-ownership_418B795B (graasp-dev-h5p/s3-bucket-ownership): Refreshing state... [id=graasp-dev-h5p]
graasp-dev  aws_s3_bucket_website_configuration.graasp-dev-landing_s3-website-configuration_4A2D7D4A (graasp-dev-landing/s3-website-configuration): Refreshing state... [id=graasp-dev-landing]
graasp-dev  aws_s3_bucket_ownership_controls.graasp-dev-landing_s3-bucket-ownership_91EDE8A7 (graasp-dev-landing/s3-bucket-ownership): Refreshing state... [id=graasp-dev-landing]
graasp-dev  aws_s3_bucket_public_access_block.graasp-dev-landing_s3-block-public-access_8EFA0218 (graasp-dev-landing/s3-block-public-access): Refreshing state... [id=graasp-dev-landing]
graasp-dev  data.aws_iam_policy_document.graasp-dev-landing_allow_public_access_DE5F5A04 (graasp-dev-landing/allow_public_access): Reading...
graasp-dev  data.aws_iam_policy_document.graasp-dev-landing_allow_public_access_DE5F5A04 (graasp-dev-landing/allow_public_access): Read complete after 0s [id=3063795264]
graasp-dev  aws_s3_bucket_cors_configuration.graasp-dev-file-items_s3-cors-config_531774F3 (graasp-dev-file-items/s3-cors-config): Refreshing state... [id=graasp-dev-file-items]
graasp-dev  aws_s3_bucket_public_access_block.graasp-dev-file-items_s3-block-public-access_DD6519C0 (graasp-dev-file-items/s3-block-public-access): Refreshing state... [id=graasp-dev-file-items]
graasp-dev  aws_s3_bucket_ownership_controls.graasp-dev-file-items_s3-bucket-ownership_9BB45BB8 (graasp-dev-file-items/s3-bucket-ownership): Refreshing state... [id=graasp-dev-file-items]
graasp-dev  aws_s3_bucket_ownership_controls.graasp-dev-admin_s3-bucket-ownership_E2B795DE (graasp-dev-admin/s3-bucket-ownership): Refreshing state... [id=graasp-dev-admin]
graasp-dev  aws_s3_bucket_website_configuration.graasp-dev-admin_s3-website-configuration_982EB24B (graasp-dev-admin/s3-website-configuration): Refreshing state... [id=graasp-dev-admin]
graasp-dev  data.aws_iam_policy_document.graasp-dev-admin_allow_public_access_C4AD10BD (graasp-dev-admin/allow_public_access): Reading...
graasp-dev  data.aws_iam_policy_document.graasp-dev-admin_allow_public_access_C4AD10BD (graasp-dev-admin/allow_public_access): Read complete after 0s [id=4244781079]
graasp-dev  aws_s3_bucket_public_access_block.graasp-dev-admin_s3-block-public-access_CE38E6EE (graasp-dev-admin/s3-block-public-access): Refreshing state... [id=graasp-dev-admin]
graasp-dev  module.graasp-dev-etherpad-postgres_db_17D31B7A.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0]: Refreshing state... [id=graasp-dev-etherpad-rds-monitoring-role-20231009123439796700000005]
graasp-dev  data.aws_iam_policy_document.graasp-dev-maintenance_allow_public_access_8F6F3848 (graasp-dev-maintenance/allow_public_access): Reading...
graasp-dev  data.aws_iam_policy_document.graasp-dev-maintenance_allow_public_access_8F6F3848 (graasp-dev-maintenance/allow_public_access): Read complete after 0s [id=2448502661]
graasp-dev  aws_s3_bucket_website_configuration.graasp-dev-maintenance_s3-website-configuration_50149944 (graasp-dev-maintenance/s3-website-configuration): Refreshing state... [id=graasp-dev-maintenance]
graasp-dev  aws_s3_bucket_public_access_block.graasp-dev-maintenance_s3-block-public-access_C8FD87F8 (graasp-dev-maintenance/s3-block-public-access): Refreshing state... [id=graasp-dev-maintenance]
graasp-dev  aws_s3_bucket_ownership_controls.graasp-dev-maintenance_s3-bucket-ownership_1588A828 (graasp-dev-maintenance/s3-bucket-ownership): Refreshing state... [id=graasp-dev-maintenance]
graasp-dev  aws_s3_bucket_policy.graasp-dev-map_s3-policy_63155158 (graasp-dev-map/s3-policy): Refreshing state... [id=graasp-dev-map]
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0]: Refreshing state... [id=graasp-dev-rds-monitoring-role-20231009123438644600000004]
graasp-dev  aws_s3_bucket_policy.graasp-dev-auth_s3-policy_E1D1F49B (graasp-dev-auth/s3-policy): Refreshing state... [id=graasp-dev-auth]
graasp-dev  aws_security_group.graasp-dev-lb-security-group (graasp-dev-lb-security-group): Refreshing state... [id=sg-0f07f40e7da03b966]
graasp-dev  aws_security_group.graasp-dev-library-security-group (graasp-dev-library-security-group): Refreshing state... [id=sg-07bae39853af00427]
graasp-dev  aws_security_group.graasp-dev-etherpad-security-group (graasp-dev-etherpad-security-group): Refreshing state... [id=sg-0ffb7f564703627af]
graasp-dev  aws_security_group.graasp-dev-backend-security-group (graasp-dev-backend-security-group): Refreshing state... [id=sg-014f1fd084973fd06]
graasp-dev  aws_security_group.graasp-dev-gatekeeper_graasp-dev-gatekeeper-security-group_92E8E7CC (graasp-dev-gatekeeper/graasp-dev-gatekeeper-security-group): Refreshing state... [id=sg-036836715bbca8a32]
graasp-dev  aws_security_group.graasp-dev-meilisearch-security-group (graasp-dev-meilisearch-security-group): Refreshing state... [id=sg-0b3ce2813b8775eba]
graasp-dev  aws_security_group.graasp-dev-iframely-security-group (graasp-dev-iframely-security-group): Refreshing state... [id=sg-0ca4813c62c9d17a3]
graasp-dev  aws_security_group.graasp-dev-etherpad-postgres_graasp-dev-etherpad-db-security-group_5536552C (graasp-dev-etherpad-postgres/graasp-dev-etherpad-db-security-group): Refreshing state... [id=sg-013be41be980f2c86]
graasp-dev  aws_security_group.graasp-dev-postgres_graasp-dev-db-security-group_6A637215 (graasp-dev-postgres/graasp-dev-db-security-group): Refreshing state... [id=sg-009f5a0d494264c65]
graasp-dev  module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-09991359fa2a53c1c]
graasp-dev  aws_cloudfront_distribution.graasp-dev-map-cloudfront (graasp-dev-map-cloudfront): Refreshing state... [id=E6PQ70ZU8V34Q]
graasp-dev  module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-01955c8cc5f6d5181]
graasp-dev  module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-055a0124ce88123b2]
graasp-dev  module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-01f44d93731acccb7]
graasp-dev  module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0596b784e2da6e5c6]
graasp-dev  aws_s3_bucket_policy.graasp-dev-h5p_s3-policy_9DB0282E (graasp-dev-h5p/s3-policy): Refreshing state... [id=graasp-dev-h5p]
graasp-dev  aws_s3_bucket_website_configuration.graasp-dev-analytics_s3-website-configuration_395CAD4F (graasp-dev-analytics/s3-website-configuration): Refreshing state... [id=graasp-dev-analytics]
graasp-dev  data.aws_iam_policy_document.graasp-dev-analytics_allow_public_access_7EB98E21 (graasp-dev-analytics/allow_public_access): Reading...
graasp-dev  data.aws_iam_policy_document.graasp-dev-analytics_allow_public_access_7EB98E21 (graasp-dev-analytics/allow_public_access): Read complete after 0s [id=994142342]
graasp-dev  aws_s3_bucket_ownership_controls.graasp-dev-analytics_s3-bucket-ownership_60A2F232 (graasp-dev-analytics/s3-bucket-ownership): Refreshing state... [id=graasp-dev-analytics]
graasp-dev  aws_s3_bucket_public_access_block.graasp-dev-analytics_s3-block-public-access_D50BFCBF (graasp-dev-analytics/s3-block-public-access): Refreshing state... [id=graasp-dev-analytics]
graasp-dev  aws_cloudfront_distribution.graasp-dev-auth-cloudfront (graasp-dev-auth-cloudfront): Refreshing state... [id=E3QXD6029ZLRUC]
graasp-dev  aws_s3_bucket_public_access_block.graasp-dev-player_s3-block-public-access_2D924E86 (graasp-dev-player/s3-block-public-access): Refreshing state... [id=graasp-dev-player]
graasp-dev  data.aws_iam_policy_document.graasp-dev-player_allow_public_access_AB634BF6 (graasp-dev-player/allow_public_access): Reading...
graasp-dev  data.aws_iam_policy_document.graasp-dev-player_allow_public_access_AB634BF6 (graasp-dev-player/allow_public_access): Read complete after 0s [id=3834136389]
graasp-dev  aws_s3_bucket_website_configuration.graasp-dev-player_s3-website-configuration_BA187414 (graasp-dev-player/s3-website-configuration): Refreshing state... [id=graasp-dev-player]
            aws_s3_bucket_ownership_controls.graasp-dev-player_s3-bucket-ownership_C82B0AEE (graasp-dev-player/s3-bucket-ownership): Refreshing state... [id=graasp-dev-player]
graasp-dev  aws_s3_bucket_website_configuration.graasp-dev-assets_s3-website-configuration_6D1735B5 (graasp-dev-assets/s3-website-configuration): Refreshing state... [id=graasp-dev-assets]
graasp-dev  data.aws_iam_policy_document.graasp-dev-assets_allow_public_access_59580A32 (graasp-dev-assets/allow_public_access): Reading...
graasp-dev  data.aws_iam_policy_document.graasp-dev-assets_allow_public_access_59580A32 (graasp-dev-assets/allow_public_access): Read complete after 0s [id=661570887]
graasp-dev  aws_s3_bucket_ownership_controls.graasp-dev-assets_s3-bucket-ownership_1BE1C46A (graasp-dev-assets/s3-bucket-ownership): Refreshing state... [id=graasp-dev-assets]
graasp-dev  aws_s3_bucket_public_access_block.graasp-dev-assets_s3-block-public-access_D15DF7EF (graasp-dev-assets/s3-block-public-access): Refreshing state... [id=graasp-dev-assets]
graasp-dev  aws_s3_bucket_policy.graasp-dev-landing_s3-policy_CD940047 (graasp-dev-landing/s3-policy): Refreshing state... [id=graasp-dev-landing]
graasp-dev  aws_cloudfront_distribution.graasp-dev-h5p-cloudfront (graasp-dev-h5p-cloudfront): Refreshing state... [id=E3B7XJV46O4VB4]
graasp-dev  aws_s3_bucket_policy.graasp-dev-admin_s3-policy_1AE743F7 (graasp-dev-admin/s3-policy): Refreshing state... [id=graasp-dev-admin]
graasp-dev  aws_cloudfront_distribution.graasp-dev-landing-cloudfront (graasp-dev-landing-cloudfront): Refreshing state... [id=E2MPNM5GOBNY0H]
graasp-dev  aws_s3_bucket_policy.graasp-dev-maintenance_s3-policy_DA8583B1 (graasp-dev-maintenance/s3-policy): Refreshing state... [id=graasp-dev-maintenance]
graasp-dev  aws_s3_bucket_ownership_controls.graasp-dev-account_s3-bucket-ownership_66A731F2 (graasp-dev-account/s3-bucket-ownership): Refreshing state... [id=graasp-dev-account]
graasp-dev  aws_s3_bucket_website_configuration.graasp-dev-account_s3-website-configuration_6ECAAB4F (graasp-dev-account/s3-website-configuration): Refreshing state... [id=graasp-dev-account]
graasp-dev  aws_s3_bucket_public_access_block.graasp-dev-account_s3-block-public-access_882CFDD8 (graasp-dev-account/s3-block-public-access): Refreshing state... [id=graasp-dev-account]
graasp-dev  data.aws_iam_policy_document.graasp-dev-account_allow_public_access_4663AEFE (graasp-dev-account/allow_public_access): Reading...
graasp-dev  data.aws_iam_policy_document.graasp-dev-account_allow_public_access_4663AEFE (graasp-dev-account/allow_public_access): Read complete after 0s [id=2163471972]
graasp-dev  aws_s3_bucket_public_access_block.graasp-dev-apps_s3-block-public-access_05DA1D21 (graasp-dev-apps/s3-block-public-access): Refreshing state... [id=graasp-dev-apps]
graasp-dev  aws_s3_bucket_website_configuration.graasp-dev-apps_s3-website-configuration_7E3F72D4 (graasp-dev-apps/s3-website-configuration): Refreshing state... [id=graasp-dev-apps]
graasp-dev  data.aws_iam_policy_document.graasp-dev-apps_allow_public_access_9E010C09 (graasp-dev-apps/allow_public_access): Reading...
graasp-dev  aws_s3_bucket_ownership_controls.graasp-dev-apps_s3-bucket-ownership_699CAAD9 (graasp-dev-apps/s3-bucket-ownership): Refreshing state... [id=graasp-dev-apps]
            data.aws_iam_policy_document.graasp-dev-apps_allow_public_access_9E010C09 (graasp-dev-apps/allow_public_access): Read complete after 0s [id=4070198440]
graasp-dev  aws_s3_bucket_public_access_block.graasp-dev-builder_s3-block-public-access_E82A62FB (graasp-dev-builder/s3-block-public-access): Refreshing state... [id=graasp-dev-builder]
graasp-dev  data.aws_iam_policy_document.graasp-dev-builder_allow_public_access_17867863 (graasp-dev-builder/allow_public_access): Reading...
graasp-dev  data.aws_iam_policy_document.graasp-dev-builder_allow_public_access_17867863 (graasp-dev-builder/allow_public_access): Read complete after 0s [id=2027949331]
            aws_s3_bucket_website_configuration.graasp-dev-builder_s3-website-configuration_AE8DACB7 (graasp-dev-builder/s3-website-configuration): Refreshing state... [id=graasp-dev-builder]
graasp-dev  aws_s3_bucket_ownership_controls.graasp-dev-builder_s3-bucket-ownership_32C20CD8 (graasp-dev-builder/s3-bucket-ownership): Refreshing state... [id=graasp-dev-builder]
graasp-dev  aws_cloudfront_distribution.graasp-dev-admin-cloudfront (graasp-dev-admin-cloudfront): Refreshing state... [id=EJQRECLT1CFKT]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-load-balancer_allow-https_0223BC47 (graasp-dev-load-balancer/allow-https): Refreshing state... [id=sgr-0d7110664852fbdc7]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-load-balancer_allow-http-ipv6_91743348 (graasp-dev-load-balancer/allow-http-ipv6): Refreshing state... [id=sgr-084bba5f4b221f189]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-load-balancer_allow-http_0E987E63 (graasp-dev-load-balancer/allow-http): Refreshing state... [id=sgr-0dbd5cad25b6a1a87]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-load-balancer_allow-https-ipv6_DC496355 (graasp-dev-load-balancer/allow-https-ipv6): Refreshing state... [id=sgr-023719db02da6a2a8]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-load-balancer_graasp-dev-allow-all_001EC5EB (graasp-dev-load-balancer/graasp-dev-allow-all): Refreshing state... [id=sgr-08d13e43e33fd5b5a]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-etherpad-allow-all (graasp-dev-etherpad-allow-all): Refreshing state... [id=sgr-06470ffe6a0df1219]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-etherpad-allow-load-balancer (graasp-dev-etherpad-allow-load-balancer): Refreshing state... [id=sgr-06e2e5786d9ade6fb]
graasp-dev  aws_cloudfront_distribution.graasp-dev-maintenance-cloudfront (graasp-dev-maintenance-cloudfront): Refreshing state... [id=EGBVR5KHBTMNX]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-library-allow-all (graasp-dev-library-allow-all): Refreshing state... [id=sgr-03cd64d6e8521413a]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-library-allow-load-balancer (graasp-dev-library-allow-load-balancer): Refreshing state... [id=sgr-04e219db366df9a40]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-backend-allow-load-balancer (graasp-dev-backend-allow-load-balancer): Refreshing state... [id=sgr-0f1f4d5674dff4695]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-backend-allow-all (graasp-dev-backend-allow-all): Refreshing state... [id=sgr-0f70a895b80fd309e]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-gatekeeper_graasp-dev-gatekeeper-allow-inbound-ssh_1B8A7117 (graasp-dev-gatekeeper/graasp-dev-gatekeeper/graasp-dev-gatekeeper-allow-inbound-ssh): Refreshing state... [id=sgr-0a51d11a638800750]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-gatekeeper_graasp-dev-gatekeeper-allow-all_B66B414C (graasp-dev-gatekeeper/graasp-dev-gatekeeper-allow-all): Refreshing state... [id=sgr-042fe01dcb13dead6]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-meilisearch-allow-graasp-backend (graasp-dev-meilisearch-allow-graasp-backend): Refreshing state... [id=sgr-0d502c3895f05dc26]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-allow-gatekeeper-on-meilisearch (graasp-dev-allow-gatekeeper-on-meilisearch): Refreshing state... [id=sgr-0959c46cb81a9c68e]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-meilisearch-allow-all (graasp-dev-meilisearch-allow-all): Refreshing state... [id=sgr-0418d7a3309cc5d5e]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-iframely-allow-all (graasp-dev-iframely-allow-all): Refreshing state... [id=sgr-03b6e652d0d98bb05]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-iframely-allow-graasp-backend (graasp-dev-iframely-allow-graasp-backend): Refreshing state... [id=sgr-0d4d4b4ffd0b49a87]
graasp-dev  aws_s3_bucket_policy.graasp-dev-analytics_s3-policy_47751E84 (graasp-dev-analytics/s3-policy): Refreshing state... [id=graasp-dev-analytics]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-etherpad-postgres_graasp-dev-etherpad-db-allow-all_5F6AD39A (graasp-dev-etherpad-postgres/graasp-dev-etherpad-db-allow-all): Refreshing state... [id=sgr-086eaaa92175b65c3]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-etherpad-postgres_graasp-dev-etherpad-db-allow-etherpad_6B9E6CD6 (graasp-dev-etherpad-postgres/graasp-dev-etherpad-db-allow-etherpad): Refreshing state... [id=sgr-01f121d0e27fb3e2a]
graasp-dev  module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-09991359fa2a53c1c1080289494]
graasp-dev  aws_s3_bucket_policy.graasp-dev-player_s3-policy_79B5A424 (graasp-dev-player/s3-policy): Refreshing state... [id=graasp-dev-player]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-allow-gatekeeper-on-postgres (graasp-dev-allow-gatekeeper-on-postgres): Refreshing state... [id=sgr-0058c3745753e6995]
graasp-dev  aws_vpc_security_group_egress_rule.graasp-dev-postgres_graasp-dev-db-allow-all_0D9DEE53 (graasp-dev-postgres/graasp-dev-db-allow-all): Refreshing state... [id=sgr-0199bcbb086d17111]
graasp-dev  aws_vpc_security_group_ingress_rule.graasp-dev-postgres_graasp-dev-db-allow-graasp-backend_E8883EF3 (graasp-dev-postgres/graasp-dev-db-allow-graasp-backend): Refreshing state... [id=sgr-007f1bb79fc0de776]
graasp-dev  aws_s3_bucket_policy.graasp-dev-assets_s3-policy_B5DD3F7D (graasp-dev-assets/s3-policy): Refreshing state... [id=graasp-dev-assets]
graasp-dev  module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0953114662597b70b]
graasp-dev  module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-065b7c3d10a5adb5f]
graasp-dev  module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0ba3fbc906b89068b]
graasp-dev  aws_s3_bucket_policy.graasp-dev-account_s3-policy_02771A3D (graasp-dev-account/s3-policy): Refreshing state... [id=graasp-dev-account]
graasp-dev  aws_cloudfront_distribution.graasp-dev-analytics-cloudfront (graasp-dev-analytics-cloudfront): Refreshing state... [id=E23F4UJ5WUYDK0]
graasp-dev  aws_cloudfront_distribution.graasp-dev-player-cloudfront (graasp-dev-player-cloudfront): Refreshing state... [id=E1Q7RJTWCI9MVT]
graasp-dev  aws_s3_bucket_policy.graasp-dev-apps_s3-policy_708B7B00 (graasp-dev-apps/s3-policy): Refreshing state... [id=graasp-dev-apps]
graasp-dev  aws_s3_bucket_policy.graasp-dev-builder_s3-policy_0743ACD6 (graasp-dev-builder/s3-policy): Refreshing state... [id=graasp-dev-builder]
graasp-dev  aws_cloudfront_distribution.graasp-dev-assets-cloudfront (graasp-dev-assets-cloudfront): Refreshing state... [id=E1TTPMNH8QPMJP]
graasp-dev  aws_cloudfront_distribution.graasp-dev-apps-cloudfront (graasp-dev-apps-cloudfront): Refreshing state... [id=E354WPS1CZ652D]
graasp-dev  aws_cloudfront_distribution.graasp-dev-account-cloudfront (graasp-dev-account-cloudfront): Refreshing state... [id=E3AQ3WOWQG30WK]
graasp-dev  aws_cloudfront_distribution.graasp-dev-builder-cloudfront (graasp-dev-builder-cloudfront): Refreshing state... [id=E3K2C3E7VQ5L5R]
graasp-dev  aws_lb.graasp-dev-load-balancer_lb_9A06B77C (graasp-dev-load-balancer/lb): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:loadbalancer/app/graasp-dev/2d9df8ffedc22275]
graasp-dev  aws_instance.graasp-dev-gatekeeper_graasp-dev-gatekeeper-ec2_A55DD5DA (graasp-dev-gatekeeper/graasp-dev-gatekeeper/graasp-dev-gatekeeper-ec2): Refreshing state... [id=i-0fd04870b794c75b3]
graasp-dev  aws_ecs_service.graasp-dev_iframely-service_8F7B5C1F (graasp-dev/iframely-service): Refreshing state... [id=arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/iframely]
graasp-dev  aws_ecs_service.graasp-dev_meilisearch-service_3A736F80 (graasp-dev/meilisearch-service): Refreshing state... [id=arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/meilisearch]
graasp-dev  module.graasp-dev-etherpad-postgres_db_17D31B7A.module.db_subnet_group.aws_db_subnet_group.this[0]: Refreshing state... [id=graasp-dev-etherpad-20231009123833124600000014]
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_subnet_group.aws_db_subnet_group.this[0]: Refreshing state... [id=graasp-dev-20231009123833192500000015]
graasp-dev  module.graasp-dev-postgres_db_F1D5DB7A.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-3CNANXEZMD2SUYDRIDBIHT6F2M]
graasp-dev  module.graasp-dev-etherpad-postgres_db_17D31B7A.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=db-FLDVNVJLKJJX3HXSACCV6OSHCA]
graasp-dev  aws_lb_listener.graasp-dev-load-balancer_lb-listener-https_E069C227 (graasp-dev-load-balancer/lb-listener-https): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener/app/graasp-dev/2d9df8ffedc22275/416636dae9d8bda4]
graasp-dev  aws_lb_listener.graasp-dev-load-balancer_lb-listener-http-redirect_309E2C64 (graasp-dev-load-balancer/lb-listener-http-redirect): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener/app/graasp-dev/2d9df8ffedc22275/9cc00852f3f90d6a]
graasp-dev  aws_ecs_task_definition.graasp-dev_etherpad_D664EB2D (graasp-dev/etherpad): Refreshing state... [id=etherpad]
graasp-dev  aws_lb_listener_rule.graasp-dev-load-balancer_graasp-dev-shortener_2A4B0FBC (graasp-dev-load-balancer/graasp-dev-shortener): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/2d9df8ffedc22275/416636dae9d8bda4/a0a229972dcce063]
graasp-dev  aws_lb_target_group.graasp-dev_graasp-target-group_7E05BC31 (graasp-dev/graasp-target-group): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:targetgroup/graasp/75b2cf400edd1909]
graasp-dev  aws_lb_target_group.graasp-dev_etherpad-target-group_94F8091C (graasp-dev/etherpad-target-group): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:targetgroup/etherpad/69fe8f88d1211cfe]
graasp-dev  aws_lb_target_group.graasp-dev_graasp-library-target-group_47035354 (graasp-dev/graasp-library-target-group): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:targetgroup/graasp-library/1f502836d98e92e0]
graasp-dev  aws_lb_listener_rule.graasp-dev_graasp-rule_8589AD50 (graasp-dev/graasp-rule): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/2d9df8ffedc22275/416636dae9d8bda4/5bba1be112990e2f]
graasp-dev  aws_ecs_service.graasp-dev_graasp-service_BD538BD2 (graasp-dev/graasp-service): Refreshing state... [id=arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/graasp]
graasp-dev  aws_lb_listener_rule.graasp-dev_etherpad-rule_74CA3679 (graasp-dev/etherpad-rule): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/2d9df8ffedc22275/416636dae9d8bda4/d95b5f32dc661338]
graasp-dev  aws_ecs_service.graasp-dev_etherpad-service_366B5CFC (graasp-dev/etherpad-service): Refreshing state... [id=arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/etherpad]
graasp-dev  aws_lb_listener_rule.graasp-dev_graasp-library-rule_AC381C09 (graasp-dev/graasp-library-rule): Refreshing state... [id=arn:aws:elasticloadbalancing:eu-central-1:299720865162:listener-rule/app/graasp-dev/2d9df8ffedc22275/416636dae9d8bda4/47b6511ce97bab5a]
graasp-dev  aws_ecs_service.graasp-dev_graasp-library-service_35621E15 (graasp-dev/graasp-library-service): Refreshing state... [id=arn:aws:ecs:eu-central-1:299720865162:service/graasp-dev/graasp-library]
graasp-dev  aws_appautoscaling_target.graasp-dev_graasp-service-autoscaling-target_517CCDCE (graasp-dev/graasp-service-autoscaling-target): Refreshing state... [id=service/graasp-dev/graasp]
graasp-dev  aws_appautoscaling_target.graasp-dev_graasp-library-service-autoscaling-target_5E0ABD4D (graasp-dev/graasp-library-service-autoscaling-target): Refreshing state... [id=service/graasp-dev/graasp-library]
graasp-dev  aws_appautoscaling_policy.graasp-dev_graasp-service-autoscaling-policy_70C429DA (graasp-dev/graasp-service-autoscaling-policy): Refreshing state... [id=graasp]
graasp-dev  aws_appautoscaling_policy.graasp-dev_graasp-library-service-autoscaling-policy_E718A88F (graasp-dev/graasp-library-service-autoscaling-policy): Refreshing state... [id=graasp-library]
graasp-dev  Terraform used the selected providers to generate the following execution
            plan. Resource actions are indicated with the following symbols:
graasp-dev  + create
graasp-dev  - destroy
graasp-dev  Terraform will perform the following actions:

              # aws_cloudwatch_log_group.graasp-dev_redis-loggroup_AFE7CB87 (graasp-dev/redis-loggroup) will be created
              + resource "aws_cloudwatch_log_group" "graasp-dev_redis-loggroup_AFE7CB87" {
                  + arn               = (known after apply)
                  + id                = (known after apply)
                  + log_group_class   = (known after apply)
                  + name              = "/ecs/redis"
                  + name_prefix       = (known after apply)
                  + retention_in_days = 30
                  + skip_destroy      = false
                  + tags_all          = {
                      + "terraform-managed" = "true"
                    }
                }

              # aws_ecs_service.graasp-dev_redis-service_1DBE7C83 (graasp-dev/redis-service) will be created
              + resource "aws_ecs_service" "graasp-dev_redis-service_1DBE7C83" {
                  + cluster                            = "arn:aws:ecs:eu-central-1:299720865162:cluster/graasp-dev"
                  + deployment_maximum_percent         = 200
                  + deployment_minimum_healthy_percent = 100
                  + desired_count                      = 1
                  + enable_ecs_managed_tags            = false
                  + enable_execute_command             = false
                  + iam_role                           = (known after apply)
                  + id                                 = (known after apply)
                  + launch_type                        = "FARGATE"
                  + name                               = "redis"
                  + platform_version                   = (known after apply)
                  + scheduling_strategy                = "REPLICA"
                  + tags_all                           = {
                      + "terraform-managed" = "true"
                    }
                  + task_definition                    = (known after apply)
                  + triggers                           = (known after apply)
                  + wait_for_steady_state              = false

                  + network_configuration {
                      + assign_public_ip = true
                      + security_groups  = (known after apply)
                      + subnets          = [
                          + "subnet-01f44d93731acccb7",
                          + "subnet-055a0124ce88123b2",
                          + "subnet-0596b784e2da6e5c6",
                        ]
                    }

                  + service_connect_configuration {
                      + enabled   = true
                      + namespace = "arn:aws:servicediscovery:eu-central-1:299720865162:namespace/ns-us3rov3ukfoth5ox"

                      + service {
                          + discovery_name = "graasp-redis"
                          + port_name      = "redis-6379-tcp"

                          + client_alias {
                              + dns_name = "graasp-redis"
                              + port     = 6379
                            }
                        }
                    }
                }

              # aws_ecs_task_definition.graasp-dev_redis_E9CE963D (graasp-dev/redis) will be created
              + resource "aws_ecs_task_definition" "graasp-dev_redis_E9CE963D" {
                  + arn                      = (known after apply)
                  + arn_without_revision     = (known after apply)
                  + container_definitions    = jsonencode(
                        [
                          + {
                              + environment      = []
                              + image            = "redis:7-alpine"
                              + logConfiguration = {
                                  + logDriver = "awslogs"
                                  + options   = {
                                      + awslogs-group         = "/ecs/redis"
                                      + awslogs-region        = "eu-central-1"
                                      + awslogs-stream-prefix = "ecs"
                                    }
                                }
                              + name             = "redis"
                              + portMappings     = [
                                  + {
                                      + containerPort = 6379
                                      + hostPort      = 6379
                                      + name          = "redis-6379-tcp"
                                    },
                                ]
                            },
                        ]
                    )
                  + cpu                      = "256"
                  + execution_role_arn       = "arn:aws:iam::299720865162:role/graasp-dev-ecs-execution-role"
                  + family                   = "redis"
                  + id                       = (known after apply)
                  + memory                   = "512"
                  + network_mode             = "awsvpc"
                  + requires_compatibilities = [
                      + "FARGATE",
                    ]
                  + revision                 = (known after apply)
                  + skip_destroy             = false
                  + tags_all                 = {
                      + "terraform-managed" = "true"
                    }
                  + track_latest             = false
                }

              # aws_elasticache_cluster.graasp-dev-redis_C864F0E3 will be destroyed
              # (because aws_elasticache_cluster.graasp-dev-redis_C864F0E3 is not in configuration)
              - resource "aws_elasticache_cluster" "graasp-dev-redis_C864F0E3" {
                  - apply_immediately          = true -> null
                  - arn                        = "arn:aws:elasticache:eu-central-1:299720865162:cluster:graasp-dev-redis" -> null
                  - auto_minor_version_upgrade = "true" -> null
                  - availability_zone          = "eu-central-1c" -> null
                  - az_mode                    = "single-az" -> null
                  - cache_nodes                = [
                      - {
                          - address           = "graasp-dev-redis.t5pqrj.0001.euc1.cache.amazonaws.com"
                          - availability_zone = "eu-central-1c"
                          - id                = "0001"
                          - port              = 6379
                            # (1 unchanged attribute hidden)
                        },
                    ] -> null
                  - cluster_id                 = "graasp-dev-redis" -> null
                  - engine                     = "redis" -> null
                  - engine_version             = "6.2" -> null
                  - engine_version_actual      = "6.2.6" -> null
                  - id                         = "graasp-dev-redis" -> null
                  - ip_discovery               = "ipv4" -> null
                  - maintenance_window         = "sat:00:00-sat:01:00" -> null
                  - network_type               = "ipv4" -> null
                  - node_type                  = "cache.t3.micro" -> null
                  - num_cache_nodes            = 1 -> null
                  - parameter_group_name       = "default.redis6.x" -> null
                  - port                       = 6379 -> null
                  - security_group_ids         = [
                      - "sg-028d965f91f27e896",
                    ] -> null
                  - snapshot_retention_limit   = 0 -> null
                  - snapshot_window            = "03:00-04:00" -> null
                  - subnet_group_name          = "graasp-dev" -> null
                  - tags                       = {} -> null
                  - tags_all                   = {
                      - "terraform-managed" = "true"
                    } -> null
                  - transit_encryption_enabled = false -> null
                    # (2 unchanged attributes hidden)
                }

              # aws_elasticache_subnet_group.graasp-dev-redis_graasp-dev-redis-subnet-group_E192F4DD will be destroyed
              # (because aws_elasticache_subnet_group.graasp-dev-redis_graasp-dev-redis-subnet-group_E192F4DD is not in configuration)
              - resource "aws_elasticache_subnet_group" "graasp-dev-redis_graasp-dev-redis-subnet-group_E192F4DD" {
                  - arn         = "arn:aws:elasticache:eu-central-1:299720865162:subnetgroup:graasp-dev" -> null
                  - description = "Managed by Terraform" -> null
                  - id          = "graasp-dev" -> null
                  - name        = "graasp-dev" -> null
                  - subnet_ids  = [
                      - "subnet-01f44d93731acccb7",
                      - "subnet-055a0124ce88123b2",
                      - "subnet-0596b784e2da6e5c6",
                    ] -> null
                  - tags        = {} -> null
                  - tags_all    = {
                      - "terraform-managed" = "true"
                    } -> null
                  - vpc_id      = "vpc-0b312f17d2e08cb6e" -> null
                }

              # aws_security_group.graasp-dev-redis-security-group (graasp-dev-redis-security-group) will be created
              + resource "aws_security_group" "graasp-dev-redis-security-group" {
                  + arn                    = (known after apply)
                  + description            = "Managed by Terraform"
                  + egress                 = (known after apply)
                  + id                     = (known after apply)
                  + ingress                = (known after apply)
                  + name                   = "graasp-dev-redis"
                  + name_prefix            = (known after apply)
                  + owner_id               = (known after apply)
                  + revoke_rules_on_delete = false
                  + tags_all               = {
                      + "terraform-managed" = "true"
                    }
                  + vpc_id                 = "vpc-0b312f17d2e08cb6e"
                }

              # aws_security_group.graasp-dev-redis_graasp-dev-redis-security-group_726BAF0A will be destroyed
              # (because aws_security_group.graasp-dev-redis_graasp-dev-redis-security-group_726BAF0A is not in configuration)
              - resource "aws_security_group" "graasp-dev-redis_graasp-dev-redis-security-group_726BAF0A" {
                  - arn                    = "arn:aws:ec2:eu-central-1:299720865162:security-group/sg-028d965f91f27e896" -> null
                  - description            = "Managed by Terraform" -> null
                  - egress                 = [
                      - {
                          - cidr_blocks      = [
                              - "0.0.0.0/0",
                            ]
                          - from_port        = 0
                          - ipv6_cidr_blocks = []
                          - prefix_list_ids  = []
                          - protocol         = "-1"
                          - security_groups  = []
                          - self             = false
                          - to_port          = 0
                            # (1 unchanged attribute hidden)
                        },
                    ] -> null
                  - id                     = "sg-028d965f91f27e896" -> null
                  - ingress                = [
                      - {
                          - cidr_blocks      = []
                          - from_port        = 6379
                          - ipv6_cidr_blocks = []
                          - prefix_list_ids  = []
                          - protocol         = "tcp"
                          - security_groups  = [
                              - "sg-014f1fd084973fd06",
                            ]
                          - self             = false
                          - to_port          = 6379
                            # (1 unchanged attribute hidden)
                        },
                    ] -> null
                  - name                   = "graasp-dev-redis" -> null
                  - owner_id               = "299720865162" -> null
                  - revoke_rules_on_delete = false -> null
                  - tags                   = {} -> null
                  - tags_all               = {
                      - "terraform-managed" = "true"
                    } -> null
                  - vpc_id                 = "vpc-0b312f17d2e08cb6e" -> null
                    # (1 unchanged attribute hidden)
                }

              # aws_vpc_security_group_egress_rule.graasp-dev-redis-allow-all (graasp-dev-redis-allow-all) will be created
              + resource "aws_vpc_security_group_egress_rule" "graasp-dev-redis-allow-all" {
                  + arn                    = (known after apply)
                  + cidr_ipv4              = "0.0.0.0/0"
                  + id                     = (known after apply)
                  + ip_protocol            = "-1"
                  + security_group_id      = (known after apply)
                  + security_group_rule_id = (known after apply)
                  + tags_all               = {
                      + "terraform-managed" = "true"
                    }
                }

              # aws_vpc_security_group_egress_rule.graasp-dev-redis_graasp-dev-redis-allow-all_ED3B9B56 will be destroyed
              # (because aws_vpc_security_group_egress_rule.graasp-dev-redis_graasp-dev-redis-allow-all_ED3B9B56 is not in configuration)
              - resource "aws_vpc_security_group_egress_rule" "graasp-dev-redis_graasp-dev-redis-allow-all_ED3B9B56" {
                  - arn                    = "arn:aws:ec2:eu-central-1:299720865162:security-group-rule/sgr-0c1da168f3e9c7c2a" -> null
                  - cidr_ipv4              = "0.0.0.0/0" -> null
                  - id                     = "sgr-0c1da168f3e9c7c2a" -> null
                  - ip_protocol            = "-1" -> null
                  - security_group_id      = "sg-028d965f91f27e896" -> null
                  - security_group_rule_id = "sgr-0c1da168f3e9c7c2a" -> null
                  - tags_all               = {
                      - "terraform-managed" = "true"
                    } -> null
                }

              # aws_vpc_security_group_ingress_rule.graasp-dev-redis-allow-graasp-backend (graasp-dev-redis-allow-graasp-backend) will be created
              + resource "aws_vpc_security_group_ingress_rule" "graasp-dev-redis-allow-graasp-backend" {
                  + arn                          = (known after apply)
                  + from_port                    = 6379
                  + id                           = (known after apply)
                  + ip_protocol                  = "tcp"
                  + referenced_security_group_id = "sg-014f1fd084973fd06"
                  + security_group_id            = (known after apply)
                  + security_group_rule_id       = (known after apply)
                  + tags_all                     = {
                      + "terraform-managed" = "true"
                    }
                  + to_port                      = 6379
                }

              # aws_vpc_security_group_ingress_rule.graasp-dev-redis_graasp-dev-redis-allow-graasp-backend_780780FB will be destroyed
              # (because aws_vpc_security_group_ingress_rule.graasp-dev-redis_graasp-dev-redis-allow-graasp-backend_780780FB is not in configuration)
              - resource "aws_vpc_security_group_ingress_rule" "graasp-dev-redis_graasp-dev-redis-allow-graasp-backend_780780FB" {
                  - arn                          = "arn:aws:ec2:eu-central-1:299720865162:security-group-rule/sgr-04815752da7a5a0ca" -> null
                  - from_port                    = 6379 -> null
                  - id                           = "sgr-04815752da7a5a0ca" -> null
                  - ip_protocol                  = "tcp" -> null
                  - referenced_security_group_id = "sg-014f1fd084973fd06" -> null
                  - security_group_id            = "sg-028d965f91f27e896" -> null
                  - security_group_rule_id       = "sgr-04815752da7a5a0ca" -> null
                  - tags_all                     = {
                      - "terraform-managed" = "true"
                    } -> null
                  - to_port                      = 6379 -> null
                }

            Plan: 6 to add, 0 to change, 5 to destroy.

            ─────────────────────────────────────────────────────────────────────────────

            Saved the plan to: plan

            To perform exactly these actions, run the following command to apply:
                terraform apply "plan"


```

</details>